In [76]:
# magic command to display matplotlib plots inline within the ipython notebook webpage
%matplotlib inline

# import necessary modules
import pandas as pd, numpy as np, matplotlib.pyplot as plt
import matplotlib.cm as cm, matplotlib.font_manager as fm
# load the gps coordinate data, using the date as the full set's index
# the data files are encoded as utf-8: specify so to prevent matplotlib from choking on diacritics
df = pd.read_csv('data/summer-travel-gps-full.csv', encoding='utf-8', index_col='date', parse_dates=True)
rs = pd.read_csv('data/summer-travel-gps-dbscan.csv', encoding='utf-8')

In [62]:
df.head()

         lat       lon              date          city         country
0  51.481292 -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
1  51.474005 -0.450999  05/14/2014 09:22      Hounslow  United Kingdom
2  51.478199 -0.446081  05/14/2014 10:51      Hounslow  United Kingdom
3  51.478199 -0.446081  05/14/2014 11:24      Hounslow  United Kingdom
4  51.474146 -0.451562  05/14/2014 11:38      Hounslow  United Kingdom

In [5]:
rs.tail()

           lat        lon              date      city  country
153  40.984723  28.831658  07/06/2014 21:43  Istanbul   Turkey
154  41.001629  28.949191  07/06/2014 21:58  Istanbul   Turkey
155  41.014963  29.010762  07/07/2014 16:56  Istanbul   Turkey
156  41.033193  28.982041  07/08/2014 15:30  Istanbul   Turkey
157  48.356285  11.791710  07/09/2014 13:17    Munich  Germany

In [78]:
print(df[:5])
print(df.shape)
print(df.size) # rows, columns
print()
print(df.dtypes)
print()
print(df.info())
print()
print(df.describe())
print()
print(df.values)
print()
print(df.columns)
print()
print(df.index)

                           lat       lon          city         country
date
2014-05-14 09:07:00  51.481292 -0.451011  West Drayton  United Kingdom
2014-05-14 09:22:00  51.474005 -0.450999      Hounslow  United Kingdom
2014-05-14 10:51:00  51.478199 -0.446081      Hounslow  United Kingdom
2014-05-14 11:24:00  51.478199 -0.446081      Hounslow  United Kingdom
2014-05-14 11:38:00  51.474146 -0.451562      Hounslow  United Kingdom
(1759, 4)
7036

lat        float64
lon        float64
city        object
country     object
dtype: object

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1759 entries, 2014-05-14 09:07:00 to 2014-07-09 13:20:00
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   lat      1759 non-null   float64
 1   lon      1759 non-null   float64
 2   city     1759 non-null   object
 3   country  1759 non-null   object
dtypes: float64(2), object(2)
memory usage: 68.7+ KB
None

               lat          lon
count  1759.000000  1759.000000
mean     43.142744     7.867407
std       3.897152    10.821489
min      37.921659    -9.425103
25%      41.143072     2.150215
50%      41.385976     2.183084
75%      47.989978    18.425965
max      51.481292    29.011215

[[51.4812916 -0.4510112 'West Drayton' 'United Kingdom']
 [51.474005 -0.4509991 'Hounslow' 'United Kingdom']
 [51.4781991 -0.446081 'Hounslow' 'United Kingdom']
 ...
 [48.3562848 11.7917104 'Munich' 'Germany']
 [48.355328 11.7917104 'Munich' 'Germany']
 [48.3571104 11.7913456 'Munich' 'Germany']]

Index(['lat', 'lon', 'city', 'country'], dtype='object')

DatetimeIndex(['2014-05-14 09:07:00', '2014-05-14 09:22:00',
               '2014-05-14 10:51:00', '2014-05-14 11:24:00',
               '2014-05-14 11:38:00', '2014-05-14 12:23:00',
               '2014-05-14 12:38:00', '2014-05-14 15:11:00',
               '2014-05-14 15:25:00', '2014-05-14 15:41:00',
               ...
               '2014-07-09 06:03:00', '2014-07-09 06:18:00',
               '2014-07-09 09:03:00', '2014-07-09 09:18:00',
               '2014-07-09 13:11:00', '2014-07-09 13:13:00',
               '2014-07-09 13:14:00', '2014-07-09 13:17:00',
               '2014-07-09 13:18:00', '2014-07-09 13:20:00'],
              dtype='datetime64[ns]', name='date', length=1759, freq=None)

In [54]:
# Q1: Can you draw a bar chart for the most visited countries by using matplotlib and seaborn? You can use the df dataframe.
# Please style the chart to make it look nicer such as figsize, width, alpha, color, edgecolor, grid, xlim, and ylim

In [79]:
df.loc['2014-05-14 09:07:00']

lat             51.481292
lon             -0.451011
city         West Drayton
country    United Kingdom
Name: 2014-05-14 09:07:00, dtype: object